перестановка([],[]). перестановка([X|L],P):-перестановка(L,L1),вставить(X,L1,P).
вставить(X,L1,L2):-удалить(X,L2,L1).
удалить(X,[X|T],T). удалить(X,[Н|T],[Н|T1]):-удалить(X,T,T1).

эйнштейн:-
эйнштейн(Решение), вывод_табл(Решение).

эйнштейн(Реш) :-
	Реш =[
		[П1,Ж1],
		[П2,Ж2],
		[П3,Ж3],
		[П4,Ж4]
	],
	перестановка([чашка, стакан, кувшин, банка],[П1,П2,П3,П4]),
	перестановка([молоко, лимонад, квас ,вода],[Ж1,Ж2,Ж3,Ж4]),
	member([чашка,Ж1], Реш), Ж1 \= вода, Ж1 \= молоко,
	member([кувшин,Ж3], Реш), Ж3 \= лимонад, Ж3 \= квас,
	member([банка,Ж4], Реш), Ж4 \= вода, Ж4 \= лимонад,
	member([банка,Ж4], Реш), member([стакан,Ж2], Реш), Ж4 \= молока, Ж2 \= молоко.
	
вывод_табл([A,B,C,D]):-
	Н=['Сосуд','Жидкость'],
	write('+--------+----------+'),nl,
	writef('|%8L|%10L|',Н),nl,
	write('+--------+----------+'),nl,
	writef('|%8L|%10L|',A),nl,
	writef('|%8L|%10L|',B),nl,
	writef('|%8L|%10L|',C),nl,
	writef('|%8L|%10L|',D),nl,
	write('+--------+----------+'),nl. 