эйнштейн:-
  эйнштейн(Решение),
  вывод_табл(Решение).

перестановка([],[]).
перестановка([X|L],P):-перестановка(L,L1),вставить(X,L1,P).
вставить(X,L1,L2):-удалить(X,L2,L1).
удалить(X,[X|T],T).
удалить(X,[Н|T],[Н|T1]):-удалить(X,T,T1).

эйнштейн(Реш):-
   
   Реш =[[1,'Митя',М1],
		 [2,'Толя',М2],
		 [3,'Петя',М3],
		 [4,'Саша',М4]],
	перестановка(['российские','российские','болгарские','чешские'],[М1,М2,М3,М4]),
member([_,'Толя','российские'], Реш),
member([_,'Петя','российские'], Реш),
member([_,'Митя',М1], Реш), member([_,'Толя',М2], Реш),М1 \= М2,
member([_,'Митя',М1], Реш), member([_,'Петя',М3], Реш),М1 \= М3,
member([_,'Митя',М1], Реш), member([_,'Саша',М4], Реш),М1 \= М4,
member([_,'Толя',М2], Реш), member([_,'Саша',М4], Реш),М2 \= М4,
member([_,'Петя',М3], Реш), member([_,'Саша',М4], Реш),М3 \= М4,
member([_,'Митя',М1], Реш),М1 \= 'болгарские'.

вывод_табл([A,B,C,D]) :-
  Н=['N','Филателист.','Марка'],
  write('+--+------------+-----------+'),nl,
  writef('|%2L|%12L|%11L|',Н),nl,
  write('+--+------------+-----------+'),nl,
  writef('|%2L|%12L|%11L|',A),nl,
  writef('|%2L|%12L|%11L|',B),nl,
  writef('|%2L|%12L|%11L|',C),nl,
  writef('|%2L|%12L|%11L|',D),nl,
  write('+--+------------+-----------+'),nl.
